{
    "product id": "61253961",
    "product name": "Huawei P20 Pro 128GB Twilight",
    "opinions": [
        {
            "author": "Patrycja",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Telefon speni moje oczekiwania z to ju偶 kt贸ry z rzdu m贸j Huawei ale pierwszy z lepszej p贸ki. Wczeniej wersja lite. Notch co jest co co mi si bardzo podoba. Telefon mia mimo bdnych informacji w zestawie silikonowe etui bo sam bez niego lizga si jak po lodowisku. Bateria zawsze mi w Huawei odpowiada, aparat (jak dla mnie) bije Samsunga jak i iPhone XS na gow, przepikne zdjcia portretowe jak i te szczeg贸owe np makija偶u oka. Autofocus dziaa bez najmniejszego zawahania. Wygld cudowny ka偶dy si zachwyca. jeli chodzi o podobiestwo do iPhone nie mam zdania poniewa偶 jestem neutralna na tej paszczy藕nie i licz na dobrej jakoci parametry a on takie ma. Nie zacina si, dziaa intuicyjnie. Narazie u偶ywam go za kr贸tko 偶eby co wicej powiedzie ale na pewno znajomo bdzie bardzo owocna. ",
            "pros": "bateria. bezkonkurencyjny aparat. brak. ciekawy wygld. d藕wik. ekran. funkcjonalno. gesty. gonik stereo. gorilla glass 5. kamerka prz贸d. atwo obsugi. mo偶liwoci. nfc. notch. skaner twarzy. solidny. video slow motion. waga. wodoodporny. wygld. wygld (wersja niebieska). zdjcia",
            "cons": "bez gumy atwo wypada z reki",
            "useful": 19,
            "useless": 1,
            "purchased": true,
            "purchase_date": "2019-02-27 10:16:24",
            "review_date": "2019-02-22 08:02:34",
            "opinion_id": 10162614
        },
        {
            "author": "Marzena P.",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Telefon u偶ytkuj od paru dni, dlatego pewnie nie mog jeszcze wyda miarodajnej opinii. Niemniej jednak ju偶 teraz mog doceni intuicyjne poruszanie si po menu, trwao baterii, szybkie adowanie, pikne zdjcia i oczywicie sam wygld, zwaszcza \"pleck贸w\" jest super. Wad s odciski, kt贸re zostawia si na obudowie.. .     Zalety: . .     czas pracy baterii. .     czytnik linii papilarnych. .     funkcjonalno. .     gonik stereo. .     kamerka prz贸d. .     atwo obsugi. .     waga. .     wygld. .     jako zdj. . .     Wady:. .     wystajcy aparat. .     lady u偶ytkowania",
            "pros": "",
            "cons": "",
            "useful": 2,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2019-02-15 14:17:44",
            "review_date": "2019-02-06 20:00:14",
            "opinion_id": 10106426
        },
        {
            "author": "Karol",
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Pierwsza sprawa - nie jestem opaconym komentatorem, wic napisz co czuj - mo偶e si komu przyda.. . Przesiadaem si z Samsunga Galaxy S7.. . Pierwsze pozytywne zaskoczenie: do zestawu doczony jest darmowy pokrowiec (gumowy, prze藕roczysty case, przez wielu nazywany kondom lub plecki). . Wejcie na usb typu C jest nieco wkurzajce, bo prawie od nikogo nie da si po偶yczy adowarki.. . aduje si w mgnieniu oka i jak na razie trzyma bateri naprawd dobrze.. . Aparat wietny, cho przechodzc z Samsunga nie odczuem ogromnej r贸偶nicy, bo aparaty Samsunga s naprawd bardzo dobre.. . Odblokowywanie twarz dziaa dobrze, czytnik linii papilarnych te偶 dziaa bez zarzutu.. . Pisanie na klawiaturze\"Swift Key\" jest nieco uci偶liwe, bo sownik gubi sowa i pisze inne, czasem w og贸le niezwizane z kontekstem. W samsungu w og贸le nie byo tego problemu.. . Pozostae kwestie, to te same historie co w innych smartfonach, wic jeli komu odpowiada to co napisaem wy偶ej, to polecam.",
            "pros": "",
            "cons": "",
            "useful": 108,
            "useless": 22,
            "purchased": false,
            "purchase_date": "2019-03-02 15:33:07",
            "review_date": "",
            "opinion_id": 10180398
        },
        {
            "author": "Justyna",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Jak na razie najlepszy telefon Jaki miaam jedyn jego wad jest 偶e nie ma stabilizator obrazu podczas nagrywania A tak to bateria trzyma bardzo dugo aparat przy du偶szym Poznaniu staje si tak naprawd aparatem cyfrowym o wysokiej randze Nie mam wicej uwag co do tego telefonu Mam nadziej 偶e nie zawiedzie mnie tak jak do tej pory",
            "pros": "",
            "cons": "",
            "useful": 4,
            "useless": 2,
            "purchased": true,
            "purchase_date": "2019-01-26 13:05:26",
            "review_date": "2019-01-23 22:46:19",
            "opinion_id": 8992490
        },
        {
            "author": "mirekw11",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Telefon robi wra偶enie, zar贸wno wygldem jak r贸wnie偶 funkcjonalnoci. Robienie zdj tym telefonem to czysta przyjemno, chocia偶 wiadomo, 偶e nie do tego su偶y telefon jak sama nazwa wskazuje. Generalnie polecam ka偶demu dla kogo wa偶na jest jako zdj, szczeg贸lnie zdjcia nocne i w zych warunkach owietleniowych rozwalaj konkurencj. Bateria wytrzymuje niesamowicie dugo w por贸wnaniu do poprzedniego mojego telefonu uznanej firmy S.....g. Gabaryty telefonu powiedzia bym w sam raz, ani za du偶y, ani za may. Dla mnie bomba, idealnie le偶y w doni i bez problemu mieci si w kieszeni.",
            "pros": "bateria. bezkonkurencyjny aparat. ciekawy wygld. czas pracy na baterii. czytnik lini papilarnych. d藕wik. ekran. funkcjonalno. gesty. gonik stereo. gorilla glass 5. kamerka prz贸d. atwo obsugi. mo偶liwoci. nfc. notch. skaner twarzy. solidny. super zdjcia. video slow motion. waga. wodoodporny. zdjcia",
            "cons": "",
            "useful": 2,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2019-04-05 19:39:05",
            "review_date": "2019-04-02 15:16:36",
            "opinion_id": 10357637
        },
        {
            "author": "DAWiD.",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Dopiero od kilku dni u偶ytkuj smartfona. Jak na razie jestem bardzo zadowolony.. . Ekran- poezja ( cudowne kolory). . Aparat robi wietne zdjcia ( i te nocne xD). . Imponujcy czas pracy na baterii. Szybkie adowanie ok.1,5 h od zera.. . Na ten moment nie mam zastrze偶e.",
            "pros": "",
            "cons": "",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2019-12-31 18:16:48",
            "review_date": "2019-12-23 20:09:28",
            "opinion_id": 11512216
        },
        {
            "author": "KM",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Rewelacyjny telefon. Bardzo czuy skaner odcisku palca, ultraszybkie dziaanie, przechodzenie midzy aplikacjami, zdjcia pierwsza klasa, r贸wnie偶 nocne, intuicyjna obsuga. Jestem zachwycona!. . Jeden minusik-brak adowania bezprzewodowego.",
            "pros": "",
            "cons": "",
            "useful": 1,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2018-11-09 12:42:33",
            "review_date": "2018-10-30 11:28:24",
            "opinion_id": 8541943
        },
        {
            "author": "Maja",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Telefonu u偶ywam ju偶 jaki czas i wymienia zalety jest bardzo prosto. Bateria, ekran, aparat, stabilizacja obrazu, pynno pracy, szybkie adowanie, wygld, prdko rozpoznawania twarzy oraz pracy czytnika linii papilarnych - wszystko super. Przyznam, 偶e nawet do notcha si przyzwyczaiam, cho wczeniej uwa偶aam, 偶e to gupota. Jednak jak miaam ju偶 telefon w rku, to chciaam, 偶eby ten pikny oled mia jak najwiksz powierzchni - czyli zosta notch i schowaam przyciski funkcyjne na dole. sterowanie gestami na czytniku byskawicznie wchodzi w nawyk, dla mnie to du偶y plus, ale widziaam opinie, 偶e dla niekt贸rych to byo niewygodne. Bardzo ucieszyo mnie te偶 przezroczyste etui w zestawie - chronimy telefon, ale nie ukrywamy piknych pleck贸w.. . To mo偶e o minusach:. . Bez etui telefon brudzi si od palc贸w niemiosiernie.. . May minus - wielki ekran jest wspaniay, liczny i w og贸le, ale trudny do ogarnicia kciukiem ;) - nawet jak gestem go pomniejsze do obsugi jedn rk, to dla moich maych doni i tak jest to wyzwanie.. . Wystajcy aparat. Po prostu si boj, 偶e si porysuje i denerwuje mnie, 偶e krzywo le偶y na stole :D . . Brak gniazda mini-jack (rekompensuje to adne granie doczonych suchawek). . NAGRYWANIE 960 FPS: CIEMA. . Telefon korzysta z mniejszej iloci klatek na sekund, a \"dodatkowe klatki\" robi jakie oprogramowanie. Efekt jest adny, o ile ruch obiektu jest przewidywalny i nie za szybki. Jednak przy du偶ej szybkoci/ zmianie kierunku ruchu program si gubi, na niekt贸rych klatkach piksele gin, wida nienaturalne upynnienie obrazu. To byo bardzo rozczarowujce odkrycie. . . Nadal nie testowaam wodoodpornoci, bo zdrowy rozsdek nie pozwala mi wsadzi telefonu do wody :). . Og贸em telefon baaaaardzo polecam, ale warto wiedzie gdzie mo偶e nas rozczarowa.. Najgorsze jest to oszukane slow motion.",
            "pros": "bateria. czas pracy na baterii. czytnik linii papilarnych. ekran. funkcjonalno. gesty. gonik stereo. gorilla glass 5. kamerka prz贸d. atwo obsugi. mo偶liwoci. nfc. notch. skaner twarzy. waga. wygld. wygld (wersja niebieska). zdjcia",
            "cons": "brak stabilizacji w 60fps i 4k. samsung ma lepszej jakoci slow motion",
            "useful": 5,
            "useless": 0,
            "purchased": false,
            "purchase_date": "2018-10-09 23:28:45",
            "review_date": "",
            "opinion_id": 8426526
        },
        {
            "author": "pitbullka",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Nie jest to torpeda jakiej oczekiwaam, ale spenia moje wymagania.. . Denerwujcy jest samoczynnie wyczajcy si Messenger po okoo 3 sek pracy",
            "pros": "czas pracy na baterii. funkcjonalno. atwo obsugi. wygld",
            "cons": "",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2019-06-05 14:19:53",
            "review_date": "2019-05-13 16:00:22",
            "opinion_id": 10619141
        },
        {
            "author": "Ttt",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Kupiem 2 sztuki obie sprawuj si bez zarzut贸w. Aparat robi bdb jakoci zdjcia. Sporo tryb贸w aparatu a tak偶e manualne ustawienia. Bateria spokojnie trzyma dzie a je偶eli u偶ywamy telefonu to normalnym rzeczy typu dzwonienie SMS i troch internetu to i 2 dni pocignie. Szybkie adowanie. Solidna budowa ale bez opakowania bardzo atwo wyslizguje si z rki. Niedawno otrzyma aktualizacje do trybu slow motion - tak samo jak w s8 mo偶na ustawi obszar w kt贸rym po wykryciu ruchu zacznie nagrywa. Szkoda 偶e za te pienidze sabo radzi sobie z jakoci tych film贸w i brak stabilizacji 60 FPS i 4k... Troch sabo. Nadrabia za to zdjciami w dzie i w nocy. Bez dw贸ch zda. Tak jak mo偶na polemizowa co do jakoci dziennych zdj czy samsung czy p20pro lepszy tak w nocy przewaga totalna p20pro. Zoom optyczny jak najbardziej si sprawdza.",
            "pros": "bateria. bezkonkurencyjny aparat. brak. ciekawy wygld. czas pracy na baterii. czytnik linii papilarnych. ekran. funkcjonalno. gesty. gonik stereo. gorilla glass 5. kamerka prz贸d. atwo obsugi. mo偶liwoci. nfc. notch. skaner twarzy. solidny. video slow motion. waga. wodoodporny. wygld. wygld (wersja niebieska). zdjcia",
            "cons": "bez gumy atwo wypada z reki. brak stabilizacji w 60fps i 4k. samsung ma lepszej jakoci slow motion",
            "useful": 4,
            "useless": 1,
            "purchased": false,
            "purchase_date": "2018-08-26 17:49:10",
            "review_date": "",
            "opinion_id": 8285797
        }
    ]
}