{
    "product id": "78803054",
    "product name": "Apple AirPods 2 biały (MV7N2ZM/A)",
    "opinions": [
        {
            "author": "Anonimowy",
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Muzycznie - przeciętne. Rozmowy telefoniczne - rewelacja. No i applowy emejzing w kontekście integracji z innymi sprzętami tego producenta.",
            "pros": "jakość. łatwość z łączeniu. mała waga słuchawek i etui. można słuchać z dala od telefonu. wygląd. wygoda używania",
            "cons": "",
            "useful": 1,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2020-05-26 13:16:08",
            "review_date": "2020-05-15 11:27:25",
            "opinion_id": 12518682
        },
        {
            "author": "Dorota",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Produkt Apple - te słowa mówią wszystko. Rewelacyjne wykonanie, imponująca jakość dźwięku, wygoda użytkowania, świetnie dopasowane do chyba każdych uszu (idealnie leżą w moich malutkich uszkach i trochę większych mojego Małżonka), intuicyjne np. same się wyłączają po wyjęciu z uszu i same się włączają i łączą z telefonem po włożeniu do uszu. Łączenie z urządzeniami apple - indukcyjne, automatycznie wyszukiwane są przez telefon, iPada czy maca. Możliwość słuchania muzyki czy oglądania filmu z jednego urządzenia na dwóch parach bezprzewodowych słuchawek apple airpods. Zamienniki tzw. 1:1 są takie same tylko z wyglądu - nie oferują tych wszystkich funkcjonalności co oryginał - mam jeden nieoryginalny komplet.",
            "pros": "",
            "cons": "",
            "useful": 2,
            "useless": 4,
            "purchased": true,
            "purchase_date": "2019-10-03 11:32:59",
            "review_date": "2019-09-30 15:55:45",
            "opinion_id": 11109884
        },
        {
            "author": "Konrad",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Mam AirPods 2 od 3 miesięcy i mogę stwierdzić, że jest to najlepszy gadżet jaki miałem. Używam ich w trakcie biegania i są ekstra. Dźwięk może nie jest turbo dobry, ale nie kupowałem ich z myślą o studyjnym słuchaniu muzyki. Do treningów i normalnego użytku jak najbardziej polecam. Cena sroga, ale ja jestem zadowolony.",
            "pros": "bateria mogłaby dłużej trzymać. jakość dźwięku. można słuchać z dala od telefonu. wygląd. wygoda używania",
            "cons": "",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2019-09-27 12:09:17",
            "review_date": "2019-09-22 10:19:03",
            "opinion_id": 11088601
        },
        {
            "author": "Sławek",
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Kilka dni używania nie uprawniają mnie jeszcze do wystawienia rzetelnej opinii. Póki co słuchawki sprawują się dobrze i oby tak pozostało. Myślę, że warto się jednak zaopatrzyć w jakiś pasek łączący słuchawki i używać go np. w trakcie aktywności fizycznej, żeby nie zgubić którejś słuchawki.",
            "pros": "",
            "cons": "",
            "useful": 4,
            "useless": 12,
            "purchased": true,
            "purchase_date": "2019-05-10 15:02:48",
            "review_date": "2019-05-06 12:56:12",
            "opinion_id": 10504375
        },
        {
            "author": "Piotr",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Słuchawki wykonane bardzo dobrze, jakość dźwięku nie jest bardzo duża, ale wygoda z użytkowania jeśli ma się dużo urządzeń od Apple jest niezrównana.",
            "pros": "wygląd. wygoda używania",
            "cons": "",
            "useful": 6,
            "useless": 4,
            "purchased": true,
            "purchase_date": "2019-05-12 14:09:46",
            "review_date": "2019-05-06 15:33:32",
            "opinion_id": 10510947
        },
        {
            "author": "Daniił",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Dziękuję bardzo za dobrą pracę. O słuchawkach powiem, że wszyscy są zadowoleni. Szybko, wygodnie i bezprzewodowo. Jedyną rzeczą jest to, że czasami sygnał jest tracony.",
            "pros": "długa praca bez doładowywania. długotrwała bateria. etui z funkcją ładowania w 15min. jakość. jakość dźwięku. lekkość. mała waga słuchawek i etui. można słuchać z dala od telefonu. wygląd. wygoda używania",
            "cons": "",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2019-12-12 19:23:49",
            "review_date": "2019-12-06 20:10:47",
            "opinion_id": 11417898
        },
        {
            "author": "Użytkownik Ceneo",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "W mojej ocenie przerost formy nad treścią gdyby przełożyć stosunek ceny do produktu (ale ta uwaga oczywiście nie dotyczy tego konkretnego sklepu, efekt globalny). Kupione dla córki, która jest słuchawkami zachwycona.",
            "pros": "",
            "cons": "",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2020-03-15 14:32:03",
            "review_date": "2020-02-12 19:28:45",
            "opinion_id": 11912315
        },
        {
            "author": "Marta",
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Mąż otrzymał te słuchawki na urodziny i ciagle ich używa. Jest naprawdę zadowolony i ja razem z nim. Słuchawki są świetne pod każdym względem.",
            "pros": "bateria mogłaby dłużej trzymać. długa praca bez doładowywania. długotrwała bateria. dzwięk. etui z funkcją ładowania w 15min. jakość. jakość dźwięku. lekkość. łatwość z łączeniu. mała waga słuchawek i etui. można słuchać z dala od telefonu. nie wypada z ucha podczas ćwiczeń. ponoć kontrowersyjny wygląd w uchu. wygląd. wygoda używania",
            "cons": "brak sterowania muzyką",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2019-10-17 17:18:10",
            "review_date": "2019-09-16 15:21:59",
            "opinion_id": 11167603
        },
        {
            "author": "Agata",
            "recommendation": "",
            "stars": "3,5/5",
            "content": "Słuchawki bardzo fajne. Lekkie, same się synchronizują z telefonem. Łatwe w obsłudze. Bateria mogłaby być lepsza. W sumie polecam",
            "pros": "jakość dźwięku. można słuchać z dala od telefonu",
            "cons": "bateria mogłaby dłużej trzymać",
            "useful": 1,
            "useless": 1,
            "purchased": true,
            "purchase_date": "2019-07-26 08:20:40",
            "review_date": "2019-06-24 14:34:04",
            "opinion_id": 10836530
        },
        {
            "author": "a...0",
            "recommendation": "Nie polecam",
            "stars": "0,5/5",
            "content": "Ponieważ dostałem odpowiedź na poprzednią opinię, w której rzekomo według sklepu zapłaciłem za \"bardzo dobry odpowiednik\" 100 zł jest nieprawdą, gdyż mam rachunek wynoszący 500 zł oraz wszelkie dowody w postaci maili i zdjęć na to, że dokonano fałszerstwa. Firma potwierdza, że sprzedała podróbki (czy odpowiednik), o czym z resztą sama informuje, ale można to również udowodnić po nr seryjnych, gdyż na słuchawkach nie ma żadnych zarejestrowanych w systemie Apple, natomiast nr seryjny na pudełku można zidentyfikować w systemie. Jest to sprzedawanie \"odpowiednika\" w oryginalnym pudełku od firmy Apple dla utwierdzenia u kupującego, że kupił właśnie produkt tej firmy. Dostałem odpowiedź jedynie na jednego maila, w którym sprzedający twierdzi, że nigdy nie sprzedawał produktu Apple. Pomimo wysłania kolejnej wiadomości e-mail do sklepu z dowodami, nie dostałem żadnej odpowiedzi. Jednym z dowodów jest zdjęcie linku do słuchawek pod nazwą Apple, widać również logo sklepu gepard-mobilian.pl (nie mogę zamieścić ze względu na rozmiar zdjęcia), ale zamieszczę zrzut ekranu z mailem od ceneo o wystawieniu opinii o produkcie Apple Airpods 2. Dodatkowo jak czytający może zobaczyć w poprzedniej opinii firma się wypiera, ale łatwo jest to robić, gdy oferta została wycofana. Kupującym radzę trzymać się z dala, a jeśli dojdzie do zakupu, zachowywać wszelkie maile oraz dowody za zakup sfałszowanego produktu.",
            "pros": "",
            "cons": "",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "purchase_date": "2020-05-23 13:02:10",
            "review_date": "2019-11-03 14:03:18",
            "opinion_id": 12503247
        }
    ]
}